BAS BMEKZU Project/src/Catalogs/скEDI_ГруппыПодписей/скEDI_ГруппыПодписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>скEDI_ГруппыПодписей</name>
  <predefined>
    <items>
      <name>Бухгалтер</name>
      <description>Бухгалтер</description>
    </items>
    <items>
      <name>ОтветственноеЛицо</name>
      <description>Відповідальна особа</description>
    </items>
    <items>
      <name>ДопДокументыДФС</name>
      <description>Додаткові документи ДПС</description>
    </items>
    <items>
      <name>Руководитель</name>
      <description>Керівник</description>
    </items>
    <items>
      <name>Печать</name>
      <description>Печатка</description>
    </items>
  </predefined>
</mdclass:Catalog>

BAS BMEKZU Project/src/InformationRegisters/скEDI_ГруппыПодписей/скEDI_ГруппыПодписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>скEDI_ГруппыПодписей</name>
  <dimensions>
    <name>Подпись</name>
    <type>
      <types>CatalogRef.скEDI_Подписи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаПодписи</name>
    <type>
      <types>CatalogRef.скEDI_ГруппыПодписей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/скEDI_ИспользованиеКлючей/скEDI_ИспользованиеКлючей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_ИспользованиеКлючей</name>
  <enumValues>
    <name>Подписание</name>
  </enumValues>
  <enumValues>
    <name>Шифрование</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/скEDI_РолиПодписей/скEDI_РолиПодписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_РолиПодписей</name>
  <enumValues>
    <name>Неопределено</name>
  </enumValues>
  <enumValues>
    <name>ПодписьДиректора</name>
  </enumValues>
  <enumValues>
    <name>ПодписьБухгалтера</name>
  </enumValues>
  <enumValues>
    <name>ПодписьОтветственногоЛица</name>
  </enumValues>
  <enumValues>
    <name>СертификатШифрования</name>
  </enumValues>
  <enumValues>
    <name>ПечатьОрганизации</name>
  </enumValues>
  <enumValues>
    <name>РегистраторУСЦ</name>
  </enumValues>
  <enumValues>
    <name>ПодписьФизическогоЛица</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/скEDI_Подписи/скEDI_Подписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>скEDI_Подписи</name>
  <owners>Catalog.скEDI_Организации</owners>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДРФО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>EnumRef.скEDI_РолиПодписей</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеКлюча</name>
    <type>
      <types>EnumRef.скEDI_ИспользованиеКлючей</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>email1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяПодписьШифрования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сертификаты</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТелоСертификата</name>
      <comment>Base64-строка, построенная на основании двоичных данных файла сертификата</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДействия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДействия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИздательСертификата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючНаЗащищенномНосителе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСекретногоКлюча</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючНаСервисеCloudKey</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/Catalogs/скEDI_ГруппыПодписей/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Организация) Тогда
		СохранитьГруппыПодписиСервере();
		ЗаполнитьГруппыПодписиСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппыПодписиСервере()
	ГруппыПодписи.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	скEDI_Подписи.Ссылка,
	               |	ВЫБОР
	               |		КОГДА скEDI_ГруппыПодписейРегистр.Подпись ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ВходитВГруппу
	               |ИЗ
	               |	Справочник.скEDI_Подписи КАК скEDI_Подписи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.скEDI_ГруппыПодписей КАК скEDI_ГруппыПодписейРегистр
	               |		ПО скEDI_Подписи.Ссылка = скEDI_ГруппыПодписейРегистр.Подпись
	               |			И (скEDI_ГруппыПодписейРегистр.ГруппаПодписи = &ГруппаПодписи)
	               |ГДЕ
	               |	скEDI_Подписи.Владелец = &Организация
	               |	И скEDI_Подписи.ИспользованиеКлюча = ЗНАЧЕНИЕ(Перечисление.скEDI_ИспользованиеКлючей.Подписание)
	               |	И (скEDI_ГруппыПодписейРегистр.ГруппаПодписи ЕСТЬ НЕ NULL 
	               |			ИЛИ НЕ скEDI_Подписи.Роль В (&РолиПодписейИсключение))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	скEDI_Подписи.Наименование";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГруппаПодписи", Объект.Ссылка);
	
	РолиПодписей = Новый СписокЗначений;
	Если Объект.Ссылка = ПредопределенноеЗначение("Справочник.скEDI_ГруппыПодписей.Руководитель") Тогда
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПечатьОрганизации"));
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПодписьБухгалтера"));
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПодписьОтветственногоЛица"));
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПодписьФизическогоЛица"));
	ИначеЕсли Объект.Ссылка = ПредопределенноеЗначение("Справочник.скEDI_ГруппыПодписей.Бухгалтер") Тогда
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПечатьОрганизации"));
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПодписьДиректора"));
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПодписьОтветственногоЛица"));
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПодписьФизическогоЛица"));
	ИначеЕсли Объект.Ссылка = ПредопределенноеЗначение("Справочник.скEDI_ГруппыПодписей.Печать") Тогда
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПодписьБухгалтера"));
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПодписьДиректора"));
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПодписьОтветственногоЛица"));
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПодписьФизическогоЛица"));
	ИначеЕсли Объект.Ссылка = ПредопределенноеЗначение("Справочник.скEDI_ГруппыПодписей.ОтветственноеЛицо") Тогда
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПечатьОрганизации"));
	ИначеЕсли Объект.Ссылка = ПредопределенноеЗначение("Справочник.скEDI_ГруппыПодписей.ДопДокументыДФС") Тогда
		РолиПодписей.Добавить(ПредопределенноеЗначение("Перечисление.скEDI_РолиПодписей.ПодписьФизическогоЛица"));
	Иначе
	КонецЕсли;
	Запрос.УстановитьПараметр("РолиПодписейИсключение", РолиПодписей);
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
		НоваяСтрока = ГруппыПодписи.Добавить();
		НоваяСтрока.Подпись = ВыборкаРезультатаЗапроса.Ссылка;
		НоваяСтрока.ВходитВГруппу = ВыборкаРезультатаЗапроса.ВходитВГруппу;
		НоваяСтрока.ВходитВГруппуКеш = ВыборкаРезультатаЗапроса.ВходитВГруппу;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СохранитьГруппыПодписиСервере()
	Для Каждого ГруппаПодписи Из ГруппыПодписи Цикл
		Если ГруппаПодписи.ВходитВГруппуКеш <> ГруппаПодписи.ВходитВГруппу Тогда
			ГруппыПодписейМенеджерЗаписи = РегистрыСведений.скEDI_ГруппыПодписей.СоздатьМенеджерЗаписи();
			ГруппыПодписейМенеджерЗаписи.Подпись = ГруппаПодписи.Подпись;
			ГруппыПодписейМенеджерЗаписи.ГруппаПодписи = Объект.Ссылка;
			Если ГруппаПодписи.ВходитВГруппу Тогда
				ГруппыПодписейМенеджерЗаписи.Записать(Истина);
			Иначе
				ГруппыПодписейМенеджерЗаписи.Удалить();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	лОрганизация = Неопределено;
	Если Параметры.Свойство("Организация", лОрганизация) Тогда
		Организация = лОрганизация;
	КонецЕсли;
	Если ЗначениеЗаполнено(Организация) Тогда
		ЗаполнитьГруппыПодписиСервере();
		Элементы.ГруппыПодписи.Видимость = Истина;
	Иначе
		Элементы.ГруппыПодписи.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПодписиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
